Assignement/Lab02-incompFlows/combustorPimpleBlown/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile                                                                        
{                                                                               
    version     2.0;                                                            
    format      ascii;                                                          
    class       dictionary;                                                     
    object      blockMeshDict;                                                  
}                                                                               
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1.000000; 

vertices 
( 
    (-0.120000 -0.300000 -0.001000)
    (0.120000 -0.300000 -0.001000)
    (-0.120000 0.500000 -0.001000)
    (0.120000 0.500000 -0.001000)
    (-0.120000 -0.300000 0.001000)
    (0.120000 -0.300000 0.001000)
    (-0.120000 0.500000 0.001000)
    (0.120000 0.500000 0.001000)
    (0.000000 0.000000 -0.001000)
    (-0.005000 0.003000 -0.001000)
    (-0.040000 0.030000 -0.001000)
    (-0.025000 0.030000 -0.001000)
    (-0.002000 0.013000 -0.001000)
    (0.000000 0.011000 -0.001000)
    (0.002000 0.013000 -0.001000)
    (0.025000 0.030000 -0.001000)
    (0.040000 0.030000 -0.001000)
    (0.005000 0.003000 -0.001000)
    (0.000000 0.000000 0.001000)
    (-0.005000 0.003000 0.001000)
    (-0.040000 0.030000 0.001000)
    (-0.025000 0.030000 0.001000)
    (-0.002000 0.013000 0.001000)
    (0.000000 0.011000 0.001000)
    (0.002000 0.013000 0.001000)
    (0.025000 0.030000 0.001000)
    (0.040000 0.030000 0.001000)
    (0.005000 0.003000 0.001000)
    (-0.040000 -0.300000 -0.001000)
    (-0.120000 -0.020000 -0.001000)
    (-0.040000 -0.020000 -0.001000)
    (-0.005000 -0.300000 -0.001000)
    (-0.005000 -0.049000 -0.001000)
    (0.005000 -0.300000 -0.001000)
    (0.005000 -0.049000 -0.001000)
    (0.040000 -0.300000 -0.001000)
    (0.040000 -0.020000 -0.001000)
    (0.120000 -0.020000 -0.001000)
    (-0.120000 0.030000 -0.001000)
    (0.120000 0.030000 -0.001000)
    (-0.120000 0.050000 -0.001000)
    (-0.040000 0.050000 -0.001000)
    (-0.025000 0.050000 -0.001000)
    (-0.002000 0.033000 -0.001000)
    (0.002000 0.033000 -0.001000)
    (0.025000 0.050000 -0.001000)
    (0.040000 0.050000 -0.001000)
    (0.120000 0.050000 -0.001000)
    (-0.040000 0.500000 -0.001000)
    (-0.025000 0.500000 -0.001000)
    (-0.002000 0.500000 -0.001000)
    (0.002000 0.500000 -0.001000)
    (0.025000 0.500000 -0.001000)
    (0.040000 0.500000 -0.001000)
    (-0.040000 -0.300000 0.001000)
    (-0.120000 -0.020000 0.001000)
    (-0.040000 -0.020000 0.001000)
    (-0.005000 -0.300000 0.001000)
    (-0.005000 -0.049000 0.001000)
    (0.005000 -0.300000 0.001000)
    (0.005000 -0.049000 0.001000)
    (0.040000 -0.300000 0.001000)
    (0.040000 -0.020000 0.001000)
    (0.120000 -0.020000 0.001000)
    (-0.120000 0.030000 0.001000)
    (0.120000 0.030000 0.001000)
    (-0.120000 0.050000 0.001000)
    (-0.040000 0.050000 0.001000)
    (-0.025000 0.050000 0.001000)
    (-0.002000 0.033000 0.001000)
    (0.002000 0.033000 0.001000)
    (0.025000 0.050000 0.001000)
    (0.040000 0.050000 0.001000)
    (0.120000 0.050000 0.001000)
    (-0.040000 0.500000 0.001000)
    (-0.025000 0.500000 0.001000)
    (-0.002000 0.500000 0.001000)
    (0.002000 0.500000 0.001000)
    (0.025000 0.500000 0.001000)
    (0.040000 0.500000 0.001000)
); 

blocks 
( 
    hex (0 28 30 29 4 54 56 55)    (35 30 1)  simpleGrading (((1 0.4 6)(1 0.2 1)(1 0.4 0.25)) 0.2 1)
    hex (28 31 32 30 54 57 58 56)  (22 30 1)  simpleGrading (((1 0.5 1.3)(1 0.5 0.75)) 0.2 1)
    hex (31 33 34 32 57 59 60 58)  (6 30 1)   simpleGrading (1 0.2 1) 
    hex (33 35 36 34 59 61 62 60)  (22 30 1)  simpleGrading (((1 0.5 1.3)(1 0.5 0.75)) 0.2 1)
    hex (35 1 37 36 61 5 63 62)    (35 30 1)  simpleGrading (((1 0.4 4)(1 0.2 1)(1 0.4 0.1666)) 0.2 1)
    hex (29 30 10 38 55 56 20 64)  (35 23 1)  simpleGrading (((1 0.4 6)(1 0.2 1)(1 0.4 0.25)) 0.2 1)
    hex (30 32 9 10 56 58 19 20)   (22 23 1)  simpleGrading (((1 0.5 1.3)(1 0.5 0.75)) 0.2 1)
    hex (32 34 17 9 58 60 27 19)   (6 23 1)   edgeGrading (1 1 1 1 0.2 0.2 0.2 0.2 1 1 1 1) 
    hex (34 36 16 17 60 62 26 27)  (22 23 1)  simpleGrading (((1 0.5 1.3)(1 0.5 0.75)) 0.2 1)
    hex (36 37 39 16 62 63 65 26)  (35 23 1)  simpleGrading (((1 0.4 4)(1 0.2 1)(1 0.4 0.1666)) 0.2 1)
    hex (38 10 41 40 64 20 67 66)  (35 17 1)  simpleGrading (((1 0.4 6)(1 0.2 1)(1 0.4 0.25)) 3.5 1)
    hex (10 11 42 41 20 21 68 67)  (10 17 1)  simpleGrading (1 3.5 1) 
    hex (11 12 43 42 21 22 69 68)  (14 17 1)  simpleGrading (((1 0.5 1.8)(1 0.5 0.55)) 3.5 1)
    hex (12 14 44 43 22 24 70 69)  (3 17 1)   edgeGrading (1 1 1 1 3.5 3.5 3.5 3.5 1 1 1 1) 
    hex (14 15 45 44 24 25 71 70)  (14 17 1)  simpleGrading (((1 0.5 1.8)(1 0.5 0.55)) 3.5 1)
    hex (15 16 46 45 25 26 72 71)  (10 17 1)  simpleGrading (1 3.5 1) 
    hex (16 39 47 46 26 65 73 72)  (35 17 1)  simpleGrading (((1 0.4 4)(1 0.2 1)(1 0.4 0.1666)) 3.5 1)
    hex (40 41 48 2 66 67 74 6)    (35 60 1)  simpleGrading (((1 0.4 6)(1 0.2 1)(1 0.4 0.25)) 5 1)
    hex (41 42 49 48 67 68 75 74)  (10 60 1)   simpleGrading (1 5 1) 
    hex (42 43 50 49 68 69 76 75)  (14 60 1)   simpleGrading (((1 0.5 1.8)(1 0.5 0.55)) 5 1)
    hex (43 44 51 50 69 70 77 76)  (3 60 1)   simpleGrading (1 5 1) 
    hex (44 45 52 51 70 71 78 77)  (14 60 1)   simpleGrading (((1 0.5 1.8)(1 0.5 0.55)) 5 1)
    hex (45 46 53 52 71 72 79 78)  (10 60 1)   simpleGrading (1 5 1) 
    hex (46 47 3 53 72 73 7 79)    (35 60 1)  simpleGrading (((1 0.4 4)(1 0.2 1)(1 0.4 0.1666)) 5 1)
); 

edges 
( 
    arc 17 9  (0.000000 0.001000 -0.001000) 
    arc 27 19 (0.000000 0.001000 0.001000) 
    arc 12 14 (0.000000 0.012100 -0.001000) 
    arc 22 24 (0.000000 0.012100 0.001000) 
); 

boundary 
( 
    inlet 
    { 
        type patch; 
        faces 
        ( 
            (0 4 54 28) 
            (54 57 31 28) 
            (57 59 33 31) 
            (61 59 35 33) 
            (5 61 35 1) 
        ); 
    } 
    outlet 
    { 
        type patch; 
        faces 
        ( 
            (2 6 74 48) 
            (74 75 49 48) 
            (75 76 50 49) 
            (76 77 51 50) 
            (77 78 52 51) 
            (78 79 53 52) 
            (79 7 3 53) 
        ); 
    } 
    splitter 
    { 
        type wall; 
        faces 
        ( 
            (9 17 27 19) 
            (20 19 9 10) 
            (16 17 27 26) 
        ); 
    } 
    fuel_inlet 
    { 
        type patch; 
        faces 
        ( 
            (15 16 26 25) 
            (11 10 20 21) 
        ); 
    } 
    back 
    { 
        type wall; 
        faces 
        ( 
            (11 12 22 21) 
            (12 14 24 22) 
            (14 15 25 24) 
        ); 
    } 
    sides 
    { 
        type wall; 
        faces 
        ( 
            (0 4 55 29) 
            (29 55 64 38) 
            (38 64 66 40) 
            (40 66 6 2) 
            (3 7 73 47) 
            (47 73 65 39) 
            (39 65 63 37) 
            (37 63 5 1) 
        ); 
    } 
    frontAndBack 
    { 
        type empty; 
        faces 
        ( 
            (4 54 56 55) 
            (54 57 58 56) 
            (57 59 60 58) 
            (59 61 62 60) 
            (61 5 63 62) 
            (62 63 65 26) 
            (60 62 26 27) 
            (58 60 27 19) 
            (56 58 19 20) 
            (55 56 20 64) 
            (64 66 67 20) 
            (20 67 68 21) 
            (21 68 69 22) 
            (69 70 24 22) 
            (24 70 71 25) 
            (25 71 72 26) 
            (26 72 73 65) 
            (72 73 7 79) 
            (71 72 79 78) 
            (70 71 78 77) 
            (69 70 77 76) 
            (68 69 76 75) 
            (67 68 75 74) 
            (66 67 74 6) 
            (1 35 36 37) 
            (35 33 34 36) 
            (33 31 32 34) 
            (31 28 30 32) 
            (28 0 29 30) 
            (30 29 38 10) 
            (32 30 10 9) 
            (34 32 9 17) 
            (36 34 17 16) 
            (37 36 16 39) 
            (39 16 46 47) 
            (16 15 45 46) 
            (15 14 44 45) 
            (14 12 43 44) 
            (12 11 42 43) 
            (11 10 41 42) 
            (10 38 40 41) 
            (47 46 53 3) 
            (46 45 52 53) 
            (45 44 51 52) 
            (44 43 50 51) 
            (43 42 49 50) 
            (42 41 48 49) 
            (41 40 2 48) 
        ); 
    } 
); 

mergePatchPairs 
( 
); 
 
// ************************************************************************* // 
